# UserData Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TransmissionData..::..UserData Property
TransmissionData Class See Also
---
A string which users can store notes in.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public string UserData { get; set; }
```

Visual Basic
---
```text
Public Property UserData As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ UserData {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
TransmissionData Class
Autodesk.Revit.DB Namespace